// 将一天24小时按每半小划分成48段，我们用一个位图表示选中的时间区间，
// 例如`110000000000000000000000000000000000000000000000`，
// 表示第一个半小时和第二个半小时被选中了，其余时间段都没有被选中，
// 也就是对应00:00~01:00这个时间区间。一个位图中可能有多个不连续的
// 时间区间被选中，例如`110010000000000000000000000000000000000000000000`，
// 表示00:00-1:00和02:00-02:30这两个时间区间被选中了。

// 要求：写一个函数timeBitmapToRanges，将上述规则描述的时间位图转换成一个选中时间区间的数组。
// 示例输入：`"110010000000000000000000000000000000000000000000"`
// 示例输出：`["00:00~01:00", "02:00~02:30"]`
function timeBitmapToRanges(str) {
    var tempArr = [];
    var targetArr = [];
    for (var i = 0; i < 24; i++) {
        tempArr.push(str.slice(2 * i, 2 * i + 2))
    }
    tempArr.forEach((v, i) => {
        if (v.includes('1')) {
            if (v == '11') {
                targetArr.push(`${i > 9 ? i : '0' + i}:00-${i + 1 > 9 ? i + 1 : '0' + (i + 1)}:00`)
            } else if (v == '01') {
                targetArr.push(`${i > 9 ? i : '0' + i}:30-${i + 1 > 9 ? i + 1 : '0' + (i + 1)}:00`)
            } else {
                targetArr.push(`${i > 9 ? i : '0' + i}:00-${i > 9 ? i : '0' + i}:30`)
            }
        }
    })
    return targetArr
}
var str="110010011000000000000000000000000000000000000011"
console.log(timeBitmapToRanges(str))